let cardApp = new Vue({
    el: '#cardApp',
    data: {
        cards: [
            {title: "栈的溢出", content: "满栈添加元素称为上溢出, 空栈移除元素称为下溢出", link: "", tag: ["数据结构", "栈的性质"]},
            {title: "节点与度的关系", content: "设k为节点数, 则整个树的度为k-1, 度为0的节点数为度为2的节点数加1", link: "", tag: ["数据结构", "二叉树的性质"]},
            {
                title: "完全二叉树",
                content: "对于深度为K的，有n个结点的二叉树，当且仅当其每一个结点都与深度为K的满二叉树中编号从1至n的结点一一对应时称之为完全二叉树",
                link: "",
                tag: ["数据结构", "二叉树的性质"]
            },
            {title: "二叉排序树", content: "左右子节点和根节点满足排序关系的树, 也就是最基本的树", link: "", tag: ["数据结构", "二叉树的性质"]},
            {
                title: "最优二叉树",
                content: "最优二叉树就是从已给出的目标带权结点(单独的结点) 经过一种方式的组合形成一棵树，使树的权值最小",
                link: "",
                tag: ["数据结构", "二叉树的性质"]
            },
            {
                title: "冲突解决算法", content: "开放地址法: 根据某种规则使用其他的位置, 例如线性探查法, 平方探查法\n" +
                    "再哈希法: 使用另外的哈希函数在此计算, 包括\n" +
                    "拉链法: 也称为链地址法, 即使用链表\n" +
                    "建立公共溢出区", link: "", tag: ["数据结构", "哈希表"]
            }
        ]
    },
    methods: {
        finishCard: function (idx) {
            this.cards.splice(idx, 1)
        }
    }
})


